Revit 2026 API

# ClosestPointsPairBetweenTwoCurves Properties

---

The ClosestPointsPairBetweenTwoCurves type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Distance | Distance from point on first curve to the point on second curve. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ParameterOnFirstCurve | 1d raw (not normalized) parameter of the point on the first curve. |
|  | ParameterOnSecondCurve | 1d raw (not normalized) parameter of the point on the second curve. |
|  | XYZPointOnFirstCurve | Point on the first curve in 3d coordinates. |
|  | XYZPointOnSecondCurve | Point on the second curve in 3d coordinates. |

#### Reference

ClosestPointsPairBetweenTwoCurves Class

Autodesk.Revit.DB Namespace